Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	if(strstr(curPath, MENU_TEXT_SETUP) == curPath) {

		if (!strcmp(curPath, MENU_TEXT_SETUP)){
			menuStatusMessage = STATUS_SETUP;
			dst = generateSetupMenu(dst);
			loadStore = true;
		}

//		else if (strstr(mts, MENU_TEXT_APPEARANCE) == mts) {
//			dst = generateAppearanceMenu(dst);
//			loadStore = true;
//		}

		else if (strstr(mts, URLENCODE_MENU_TEXT_SYSTEM_INFO) == mts) {
			menuStatusMessage = STATUS_SETUP_SYSTEM_INFO;
			dst = generateSystemInfo(dst);
			loadStore = true;

		}
		else if (strstr(mts, MENU_TEXT_ESP8266_UPDATE) == mts) {
			esp8266_update();
			truncate_curPath(1);
			menuStatusMessage = buildMenuFromPath(d);
		}

		// Text line spacing
		else if (strstr(mts, MENU_TEXT_SPACING_SETUP) == mts) {

			if(d->type == Menu_Action) {

				uint8_t lineSpacing = 0;
				while (!strstr(d->entryname, spacingModes[lineSpacing]))
					lineSpacing++;

				if(user_settings.line_spacing != lineSpacing) {
					user_settings.line_spacing = lineSpacing;
					flash_set_eeprom_user_settings(user_settings);
				}

				truncate_curPath(1);
				menuStatusMessage = buildMenuFromPath(d);
			}

			else {

				menuStatusMessage = STATUS_SETUP_LINE_SPACING;

				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);

				for (uint8_t spacing = 0; spacing < sizeof spacingModes / sizeof *spacingModes; spacing++) {
					make_menu_entry(&dst, spacingModes[spacing], Menu_Action);
					if (user_settings.line_spacing == spacing)
						*(dst-1)->entryname = CHAR_SELECTION;
				}
			}
		}


		// WiFi Setup
		else if (strstr(mts, MENU_TEXT_WIFI_SETUP) == mts) {

			int i = sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP);
			if (strlen(curPath) > i){

				if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect to WiFi
					// curPath is: MENU_TEXT_SETUP + "/" + MENU_TEXT_WIFI_SETUP + "/" SSID[33] + Password + "/Enter" + '\0'
					curPath[strlen(curPath) - 6 ] = '\0'; // delete "/Enter" at end of Path

					// TODO before we send them to esp8266 escape , " and \ in SSID and Password..
			        while( curPath[i] != 30 && i < ( sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) + 31) ){
			            i++;
			        }
			        curPath[i] = 0;

			    	if(esp8266_wifi_connect( &curPath[sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP)  ],
			    			&curPath[sizeof(MENU_TEXT_WIFI_SETUP) + sizeof(MENU_TEXT_SETUP) + 32])){
			        	menuStatusMessage = wifi_connected;
			    	}else{
			        	menuStatusMessage = wifi_not_connected;
			    	}
					curPath[0] = '\0';
				}

				else
					menuStatusMessage = generateKeyboard(&dst, d, menuStatusMessage, insert_password);

			}

			else {
				menuStatusMessage = select_wifi_network;
				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
				if( esp8266_wifi_list( &dst, &num_menu_entries) == false){
		    		return esp_timeout;
		    	}
			}
		}

		else if (strstr(mts, MENU_TEXT_TV_MODE_SETUP) == mts) {

			if(d->type == Menu_Action){

				uint8_t tvMode = TV_MODE_NTSC;
				while (!strstr(d->entryname, tvModes[tvMode]))
					tvMode++;

				set_tv_mode(tvMode);

				if(user_settings.tv_mode != tvMode){
					user_settings.tv_mode = tvMode;
					flash_set_eeprom_user_settings(user_settings);
				}

				truncate_curPath(1);
				menuStatusMessage = buildMenuFromPath(d);
			}

			else {

				menuStatusMessage = STATUS_SETUP_TV_MODE;
				set_menu_status_msg(curPath);

				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);

				for (int tv = 1; tv < sizeof tvModes / sizeof *tvModes; tv++) {
					make_menu_entry(&dst, tvModes[tv], Menu_Action);
					if (user_settings.tv_mode == tv)
						*(dst-1)->entryname = CHAR_SELECTION;
				}
			}

		}

		else if (strstr(mts, MENU_TEXT_FONT_SETUP) == mts) {

			if(d->type == Menu_Action){

				uint8_t fontStyle = 0;
				while (!strstr(d->entryname, menuFontNames[fontStyle]))
					fontStyle++;

				if(user_settings.font_style != fontStyle){
					user_settings.font_style = fontStyle;
					flash_set_eeprom_user_settings(user_settings);
				}

				truncate_curPath(1);
				menuStatusMessage = buildMenuFromPath(d);
			}

			else{

				menuStatusMessage = STATUS_SETUP_FONT_STYLE;
				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);

				for (uint8_t font=0; font < sizeof menuFontNames / sizeof *menuFontNames; font++) {
					make_menu_entry_font(&dst, menuFontNames[font], Menu_Action, font);
					if (user_settings.font_style == font)
						*(dst-1)->entryname = CHAR_SELECTION;
				}
			}

		}

		else if (strstr(mts, MENU_TEXT_PLUS_CONNECT) == mts) {

			if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect user

				if( esp8266_PlusStore_API_connect() == false)
					return esp_timeout;

				esp8266_PlusStore_API_prepare_request_header(curPath, false, true );
	        	esp8266_print(http_request_header);
	        	esp8266_skip_http_response_header();
	        	while(HAL_UART_Receive(&huart1, &c, 1, 100 ) == HAL_OK){}

	        	switch (c) {
				case '0':
	        		menuStatusMessage = plus_connect_failed;
	        		break;
				case '1':
	        		menuStatusMessage = plus_created;
	        		break;
				default:
	        		menuStatusMessage = plus_connected;
	        		break;
	        	}


	        	esp8266_PlusStore_API_end_transmission();

	        	*curPath = 0;
			}

			else{

				menuStatusMessage = generateKeyboard(&dst, d, menuStatusMessage, plus_connect);
				//TODO:
//				switch (inputActive) {
//				case MODE_SHOW_INSTRUCTION:
//					menuStatusMessage = plus_connect;
//					inputActive = MODE_SHOW_INPUT;
//					break;
//				case MODE_SHOW_INPUT:
//					menuStatusMessage = keyboard_input;
//					break;
//				case MODE_SHOW_PATH:
//					break;
//				default:
//					break;
//				}

				//if (inputActive /*strlen(input_field)*/)
				//	menuStatusMessage = keyboard_input;
			}
		}

		else if (strstr(mts, MENU_TEXT_PLUS_REMOVE) == mts) {

			if( esp8266_PlusStore_API_connect() == false)
				return esp_timeout;

			esp8266_PlusStore_API_prepare_request_header(curPath, false, true );
        	esp8266_print(http_request_header);

