Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
	else if (ret == CART_CMD_PAGE_DOWN) {
		act_page--;
	}

	else if (ret == CART_CMD_PAGE_UP) {
		act_page++;
	}

	else {

		ret += act_page * numMenuItemsPerPage[user_settings.line_spacing];
		d = &menu_entries[ret];

		act_page = 0; // seems to fix the "blank" menus - because page # was not init'd on new menu

		if (d->type == Cart_File || d->type == Offline_Cart_File) {

			// TODO: THIS MAGIC NUMBER "12" SHOULD BE FIXED TO AN EQUATE
			// selection is a rom file
			int32_t max_romsize = (((BUFFER_SIZE + CCM_RAM_SIZE) * 1024)
					+ (12 - user_settings.first_free_flash_sector) * 128 * 1024);	//TODO: what's the 12?  linespermenu?

			if (d->filesize > max_romsize)
				menuStatusMessage /*main_status*/ = not_enough_menory;

			else {

				CART_TYPE cart_type = identify_cartridge(d);
				HAL_Delay(200);

				if (cart_type.base_type == base_type_ACE)
					menuStatusMessage = /*main_status =*/ romtype_ACE_unsupported;

				else if (cart_type.base_type == base_type_Load_Failed)
					menuStatusMessage = /*main_status = */rom_download_failed;

				else if (cart_type.base_type != base_type_None) {

					emulate_cartridge(cart_type, d);
					set_menu_status_byte(STATUS_StatusByteReboot, 0);
					menuStatusMessage = /*main_status = */exit_emulation;


					// ...?
					if (d->filesize > (BUFFER_SIZE * 1024)) { // reload menu
						truncate_curPath(1);
						menuStatusMessage = buildMenuFromPath(d);
					}
				}

				else
					menuStatusMessage = romtype_unknown;
			}

			truncate_curPath(1);

		}

		else {  // not a cart file...

			// selection is a directory or Menu_Action, or Keyboard_Char
			if (d->type == Leave_Menu) {

				if (strstr(curPath, "Search") == curPath)
					*curPath = 0;
				else
					truncate_curPath(1);

				inputActive = MODE_SHOW_PATH;
				*input_field = 0;
			}

			else if (d->type == Delete_Keyboard_Char) {

				unsigned int len = strlen(input_field);
				if (len) {
					input_field[--len] = 0;
					curPath[strlen(curPath) - 1] = 0;
				}
				menuStatusMessage = keyboard_input;

			} else {

				if ((d->type != Keyboard_Char && strlen(curPath) > 0)
						|| !strcmp(MENU_TEXT_SETUP"/"MENU_TEXT_PLUS_CONNECT, curPath)
						|| !strcmp(MENU_TEXT_SEARCH_FOR_ROM, curPath)) {
					strcat(curPath, "/");
				}

				if (!strcmp(d->entryname, MENU_TEXT_SPACE))
					strcpy(d->entryname, " ");

				append_entry_to_path(d);

				if (d->type == Keyboard_Char) {

					inputActive = MODE_SHOW_INPUT;
					//if (inputActive == MODE_SHOW_INPUT)
					strcat(input_field, d->entryname);


					// essentially "redundant" as the curPath won't be long enough anyway...

					if (strlen(input_field) > STATUS_MESSAGE_LENGTH - 1)
						for (int i = 0; i < STATUS_MESSAGE_LENGTH - 1; i++)
							input_field[i] = input_field[i + 1];

					menuStatusMessage = keyboard_input;
				}

				else {
					if (d->type == Menu_Action) {
						inputActive = MODE_SHOW_PATH;
						*input_field = 0;
					}
				}
			}
			menuStatusMessage = buildMenuFromPath(d);
		}
	}


	if (*input_field) {
		set_menu_status_msg(input_field);
		set_menu_status_byte(STATUS_PageType, (uint8_t) Keyboard);
	}

    else {

    	if (menuStatusMessage >= STATUS_ROOT)
    		set_menu_status_msg(status_message[menuStatusMessage]);

    	if(act_page > (num_menu_entries / numMenuItemsPerPage[user_settings.line_spacing]) )
    		act_page = 0;

    	set_menu_status_byte(STATUS_PageType, (uint8_t) Directory);
    }
    bool is_connected = esp8266_is_connected();

    createMenuForAtari(menu_entries, act_page, num_menu_entries, is_connected, plus_store_status );
    HAL_Delay(200);

  } // while(1)
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the CPU, AHB and APB busses clocks
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 432;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB busses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief USART1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART1_UART_Init(void)
{

  /* USER CODE BEGIN USART1_Init 0 */

  /* USER CODE END USART1_Init 0 */

  /* USER CODE BEGIN USART1_Init 1 */
	  __HAL_RCC_GPIOA_CLK_ENABLE();

  /* USER CODE END USART1_Init 1 */
  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART1_Init 2 */

  /* USER CODE END USART1_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* GPIO Ports Clock Enable */
//  __HAL_RCC_GPIOC_CLK_ENABLE();
  SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIOCEN);
//  __HAL_RCC_GPIOD_CLK_ENABLE();
  SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIODEN);
//  READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIOCEN);
//  READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIODEN);

  /*Configure GPIO pins : PC0 PC1 PC2 PC3
                           PC4 PC5 PC6 PC7 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3
                          |GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : PD8 PD9 PD10 PD11
                           PD12 PD13 PD14 PD15
                           PD0 PD1 PD2 PD3
                           PD4 PD5 PD6 PD7 */
  GPIO_InitStruct.Pin = GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_10|GPIO_PIN_11
                          |GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15
                          |GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3
                          |GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  set_menu_status_msg("Init error 1");
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
